{"Cardinals": ["WEEK1 Cardinals VS. Kansas City Chiefs -Sun September 11 @ 4:25PM ET", "WEEK2 Cardinals AT Las Vegas Raiders -Sun September 18 @ 4:25PM ET", "WEEK3 Cardinals VS. Los Angeles Rams -Sun September 25 @ 4:25PM ET", "WEEK4 Cardinals AT Carolina Panthers -Sun October 2 @ 4:05PM ET", "WEEK5 Cardinals VS. Philadelphia Eagles -Sun October 9 @ 4:25PM ET", "WEEK6 Cardinals AT Seattle Seahawks -Sun October 16 @ 4:05PM ET", "WEEK7 Cardinals VS. New Orleans Saints -Thu October 20 @ 8:15PM ET", "WEEK8 Cardinals AT Minnesota Vikings -Sun October 30 @ 1:00PM ET", "WEEK9 Cardinals VS. Seattle Seahawks -Sun November 6 @ 4:05PM ET", "WEEK10 Cardinals AT Los Angeles Rams -Sun November 13 @ 4:25PM ET", "WEEK11 Cardinals VS. San Francisco 49ers -Mon November 21 @ 8:15PM ET", "WEEK12 Cardinals VS. Los Angeles Chargers -Sun November 27 @ 4:05PM ET", "Bye Week", "WEEK14 Cardinals VS. New England Patriots -Mon December 12 @ 8:15PM ET", "WEEK15 Cardinals AT Denver Broncos -Sun December 18 @ 4:05PM ET", "WEEK16 Cardinals VS. Tampa Bay Buccaneers -Sun December 25 @ 8:20PM ET", "WEEK17 Cardinals AT Atlanta Falcons -Sun January 1 @ 1:00PM ET", "WEEK18 Cardinals AT San Francisco 49ers -Sun January 8 @ 1:00PM ET"], "Falcons": ["WEEK1 Falcons VS. New Orleans Saints -Sun September 11 @ 1:00PM ET", "WEEK2 Falcons AT Los Angeles Rams -Sun September 18 @ 4:05PM ET", "WEEK3 Falcons AT Seattle Seahawks -Sun September 25 @ 4:25PM ET", "WEEK4 Falcons VS. Cleveland Browns -Sun October 2 @ 1:00PM ET", "WEEK5 Falcons AT Tampa Bay Buccaneers -Sun October 9 @ 1:00PM ET", "WEEK6 Falcons VS. San Francisco 49ers -Sun October 16 @ 1:00PM ET", "WEEK7 Falcons AT Cincinnati Bengals -Sun October 23 @ 1:00PM ET", "WEEK8 Falcons VS. Carolina Panthers -Sun October 30 @ 1:00PM ET", "WEEK9 Falcons VS. Los Angeles Chargers -Sun November 6 @ 1:00PM ET", "WEEK10 Falcons AT Carolina Panthers -Thu November 10 @ 8:15PM ET", "WEEK11 Falcons VS. Chicago Bears -Sun November 20 @ 1:00PM ET", "WEEK12 Falcons AT Washington Commanders -Sun November 27 @ 1:00PM ET", "WEEK13 Falcons VS. Pittsburgh Steelers -Sun December 4 @ 1:00PM ET", "Bye Week", "WEEK15 Falcons AT New Orleans Saints -Sun December 18 @ 1:00PM ET", "WEEK16 Falcons AT Baltimore Ravens -Sat December 24 @ 1:00PM ET", "WEEK17 Falcons VS. Arizona Cardinals -Sun January 1 @ 1:00PM ET", "WEEK18 Falcons VS. Tampa Bay Buccaneers -Sun January 8 @ 1:00PM ET"], "Ravens": ["WEEK1 Ravens AT New York Jets -Sun September 11 @ 1:00PM ET", "WEEK2 Ravens VS. Miami Dolphins -Sun September 18 @ 1:00PM ET", "WEEK3 Ravens AT New England Patriots -Sun September 25 @ 1:00PM ET", "WEEK4 Ravens VS. Buffalo Bills -Sun October 2 @ 1:00PM ET", "WEEK5 Ravens VS. Cincinnati Bengals -Sun October 9 @ 8:20PM ET", "WEEK6 Ravens AT New York Giants -Sun October 16 @ 1:00PM ET", "WEEK7 Ravens VS. Cleveland Browns -Sun October 23 @ 1:00PM ET", "WEEK8 Ravens AT Tampa Bay Buccaneers -Thu October 27 @ 8:15PM ET", "WEEK9 Ravens AT New Orleans Saints -Mon November 7 @ 8:15PM ET", "Bye Week", "WEEK11 Ravens VS. Carolina Panthers -Sun November 20 @ 1:00PM ET", "WEEK12 Ravens AT Jacksonville Jaguars -Sun November 27 @ 1:00PM ET", "WEEK13 Ravens VS. Denver Broncos -Sun December 4 @ 1:00PM ET", "WEEK14 Ravens AT Pittsburgh Steelers -Sun December 11 @ 1:00PM ET", "WEEK15 Ravens AT Cleveland Browns -Sun December 18 @ 1:00PM ET", "WEEK16 Ravens VS. Atlanta Falcons -Sat December 24 @ 1:00PM ET", "WEEK17 Ravens VS. Pittsburgh Steelers -Sun January 1 @ 1:00PM ET", "WEEK18 Ravens AT Cincinnati Bengals -Sun January 8 @ 1:00PM ET"], "Bills": ["WEEK1 Bills AT Los Angeles Rams -Thu September 8 @ 8:20PM ET", "WEEK2 Bills VS. Tennessee Titans -Mon September 19 @ 7:15PM ET", "WEEK3 Bills AT Miami Dolphins -Sun September 25 @ 1:00PM ET", "WEEK4 Bills AT Baltimore Ravens -Sun October 2 @ 1:00PM ET", "WEEK5 Bills VS. Pittsburgh Steelers -Sun October 9 @ 1:00PM ET", "WEEK6 Bills AT Kansas City Chiefs -Sun October 16 @ 4:25PM ET", "Bye Week", "WEEK8 Bills VS. Green Bay Packers -Sun October 30 @ 8:20PM ET", "WEEK9 Bills AT New York Jets -Sun November 6 @ 1:00PM ET", "WEEK10 Bills VS. Minnesota Vikings -Sun November 13 @ 1:00PM ET", "WEEK11 Bills VS. Cleveland Browns -Sun November 20 @ 1:00PM ET", "WEEK12 Bills AT Detroit Lions -Thu November 24 @ 12:30PM ET", "WEEK13 Bills AT New England Patriots -Thu December 1 @ 8:15PM ET", "WEEK14 Bills VS. New York Jets -Sun December 11 @ 1:00PM ET", "WEEK15 Bills VS. Miami Dolphins -Sun December 18 @ 1:00PM ET", "WEEK16 Bills AT Chicago Bears -Sat December 24 @ 1:00PM ET", "WEEK17 Bills AT Cincinnati Bengals -Mon January 2 @ 8:30PM ET", "WEEK18 Bills VS. New England Patriots -Sun January 8 @ 1:00PM ET"], "Panthers": ["WEEK1 Panthers VS. Cleveland Browns -Sun September 11 @ 1:00PM ET", "WEEK2 Panthers AT New York Giants -Sun September 18 @ 1:00PM ET", "WEEK3 Panthers VS. New Orleans Saints -Sun September 25 @ 1:00PM ET", "WEEK4 Panthers VS. Arizona Cardinals -Sun October 2 @ 4:05PM ET", "WEEK5 Panthers VS. San Francisco 49ers -Sun October 9 @ 4:05PM ET", "WEEK6 Panthers AT Los Angeles Rams -Sun October 16 @ 4:05PM ET", "WEEK7 Panthers VS. Tampa Bay Buccaneers -Sun October 23 @ 1:00PM ET", "WEEK8 Panthers AT Atlanta Falcons -Sun October 30 @ 1:00PM ET", "WEEK9 Panthers AT Cincinnati Bengals -Sun November 6 @ 1:00PM ET", "WEEK10 Panthers VS. Atlanta Falcons -Thu November 10 @ 8:15PM ET", "WEEK11 Panthers AT Baltimore Ravens -Sun November 20 @ 1:00PM ET", "WEEK12 Panthers VS. Denver Broncos -Sun November 27 @ 1:00PM ET", "Bye Week", "WEEK14 Panthers AT Seattle Seahawks -Sun December 11 @ 4:25PM ET", "WEEK15 Panthers VS. Pittsburgh Steelers -Sun December 18 @ 1:00PM ET", "WEEK16 Panthers VS. Detroit Lions -Sat December 24 @ 1:00PM ET", "WEEK17 Panthers AT Tampa Bay Buccaneers -Sun January 1 @ 1:00PM ET", "WEEK18 Panthers AT New Orleans Saints -Sun January 8 @ 1:00PM ET"], "Bears": ["WEEK1 Bears VS. San Francisco 49ers -Sun September 11 @ 1:00PM ET", "WEEK2 Bears AT Green Bay Packers -Sun September 18 @ 8:20PM ET", "WEEK3 Bears VS. Houston Texans -Sun September 25 @ 1:00PM ET", "WEEK4 Bears AT New York Giants -Sun October 2 @ 1:00PM ET", "WEEK5 Bears AT Minnesota Vikings -Sun October 9 @ 1:00PM ET", "WEEK6 Bears VS. Washington Commanders -Thu October 13 @ 8:15PM ET", "WEEK7 Bears AT New England Patriots -Mon October 24 @ 8:15PM ET", "WEEK8 Bears AT Dallas Cowboys -Sun October 30 @ 1:00PM ET", "WEEK9 Bears VS. Miami Dolphins -Sun November 6 @ 1:00PM ET", "WEEK10 Bears VS. Detroit Lions -Sun November 13 @ 1:00PM ET", "WEEK11 Bears AT Atlanta Falcons -Sun November 20 @ 1:00PM ET", "WEEK12 Bears AT New York Jets -Sun November 27 @ 1:00PM ET", "WEEK13 Bears VS. Green Bay Packers -Sun December 4 @ 1:00PM ET", "Bye Week", "WEEK15 Bears VS. Philadelphia Eagles -Sun December 18 @ 1:00PM ET", "WEEK16 Bears VS. Buffalo Bills -Sat December 24 @ 1:00PM ET", "WEEK17 Bears AT Detroit Lions -Sun January 1 @ 1:00PM ET", "WEEK18 Bears VS. Minnesota Vikings -Sun January 8 @ 1:00PM ET"], "Bengals": ["WEEK1 Bengals VS. Pittsburgh Steelers -Sun September 11 @ 1:00PM ET", "WEEK2 Bengals AT Dallas Cowboys -Sun September 18 @ 4:25PM ET", "WEEK3 Bengals AT New York Jets -Sun September 25 @ 1:00PM ET", "WEEK4 Bengals VS. Miami Dolphins -Thu September 29 @ 8:15PM ET", "WEEK5 Bengals AT Baltimore Ravens -Sun October 9 @ 8:20PM ET", "WEEK6 Bengals AT New Orleans Saints -Sun October 16 @ 1:00PM ET", "WEEK7 Bengals VS. Atlanta Falcons -Sun October 23 @ 1:00PM ET", "WEEK8 Bengals AT Cleveland Browns -Mon October 31 @ 8:15PM ET", "WEEK9 Bengals VS. Carolina Panthers -Sun November 6 @ 1:00PM ET", "Bye Week", "WEEK11 Bengals AT Pittsburgh Steelers -Sun November 20 @ 8:20PM ET", "WEEK12 Bengals AT Tennessee Titans -Sun November 27 @ 1:00PM ET", "WEEK13 Bengals VS. Kansas City Chiefs -Sun December 4 @ 4:25PM ET", "WEEK14 Bengals VS. Cleveland Browns -Sun December 11 @ 1:00PM ET", "WEEK15 Bengals AT Tampa Bay Buccaneers -Sun December 18 @ 4:25PM ET", "WEEK16 Bengals AT New England Patriots -Sat December 24 @ 1:00PM ET", "WEEK17 Bengals VS. Buffalo Bills -Mon January 2 @ 8:30PM ET", "WEEK18 Bengals VS. Baltimore Ravens -Sun January 8 @ 1:00PM ET"], "Browns": ["WEEK1 Browns AT Carolina Panthers -Sun September 11 @ 1:00PM ET", "WEEK2 Browns VS. New York Jets -Sun September 18 @ 1:00PM ET", "WEEK3 Browns VS. Pittsburgh Steelers -Thu September 22 @ 8:15PM ET", "WEEK4 Browns AT Atlanta Falcons -Sun October 2 @ 1:00PM ET", "WEEK5 Browns VS. Los Angeles Chargers -Sun October 9 @ 1:00PM ET", "WEEK6 Browns VS. New England Patriots -Sun October 16 @ 1:00PM ET", "WEEK7 Browns AT Baltimore Ravens -Sun October 23 @ 1:00PM ET", "WEEK8 Browns VS. Cincinnati Bengals -Mon October 31 @ 8:15PM ET", "Bye Week", "WEEK10 Browns AT Miami Dolphins -Sun November 13 @ 1:00PM ET", "WEEK11 Browns AT Buffalo Bills -Sun November 20 @ 1:00PM ET", "WEEK12 Browns VS. Tampa Bay Buccaneers -Sun November 27 @ 1:00PM ET", "WEEK13 Browns AT Houston Texans -Sun December 4 @ 1:00PM ET", "WEEK14 Browns AT Cincinnati Bengals -Sun December 11 @ 1:00PM ET", "WEEK15 Browns VS. Baltimore Ravens -Sun December 18 @ 1:00PM ET", "WEEK16 Browns VS. New Orleans Saints -Sat December 24 @ 1:00PM ET", "WEEK17 Browns AT Washington Commanders -Sun January 1 @ 1:00PM ET", "WEEK18 Browns AT Pittsburgh Steelers -Sun January 8 @ 1:00PM ET"], "Cowboys": ["WEEK1 Cowboys VS. Tampa Bay Buccaneers -Sun September 11 @ 8:20PM ET", "WEEK2 Cowboys VS. Cincinnati Bengals -Sun September 18 @ 4:25PM ET", "WEEK3 Cowboys AT New York Giants -Mon September 26 @ 8:15PM ET", "WEEK4 Cowboys VS. Washington Commanders -Sun October 2 @ 1:00PM ET", "WEEK5 Cowboys AT Los Angeles Rams -Sun October 9 @ 4:25PM ET", "WEEK6 Cowboys AT Philadelphia Eagles -Sun October 16 @ 8:20PM ET", "WEEK7 Cowboys VS. Detroit Lions -Sun October 23 @ 1:00PM ET", "WEEK8 Cowboys VS. Chicago Bears -Sun October 30 @ 1:00PM ET", "Bye Week", "WEEK10 Cowboys AT Green Bay Packers -Sun November 13 @ 4:25PM ET", "WEEK11 Cowboys AT Minnesota Vikings -Sun November 20 @ 4:25PM ET", "WEEK12 Cowboys VS. New York Giants -Thu November 24 @ 4:30PM ET", "WEEK13 Cowboys VS. Indianapolis Colts -Sun December 4 @ 8:20PM ET", "WEEK14 Cowboys VS. Houston Texans -Sun December 11 @ 1:00PM ET", "WEEK15 Cowboys AT Jacksonville Jaguars -Sun December 18 @ 1:00PM ET", "WEEK16 Cowboys VS. Philadelphia Eagles -Sat December 24 @ 4:25PM ET", "WEEK17 Cowboys AT Tennessee Titans -Thu December 29 @ 8:15PM ET", "WEEK18 Cowboys AT Washington Commanders -Sun January 8 @ 1:00PM ET"], "Broncos": ["WEEK1 Broncos AT Seattle Seahawks -Mon September 12 @ 8:20PM ET", "WEEK2 Broncos VS. Houston Texans -Sun September 18 @ 4:25PM ET", "WEEK3 Broncos VS. San Francisco 49ers -Sun September 25 @ 8:20PM ET", "WEEK4 Broncos AT Las Vegas Raiders -Sun October 2 @ 4:25PM ET", "WEEK5 Broncos VS. Indianapolis Colts -Thu October 6 @ 8:15PM ET", "WEEK6 Broncos AT Los Angeles Chargers -Mon October 17 @ 8:15PM ET", "WEEK7 Broncos VS. New York Jets -Sun October 23 @ 4:05PM ET", "WEEK8 Broncos AT Jacksonville Jaguars -Sun October 30 @ 9:30AM ET", "Bye Week", "WEEK10 Broncos AT Tennessee Titans -Sun November 13 @ 1:00PM ET", "WEEK11 Broncos VS. Las Vegas Raiders -Sun November 20 @ 4:05PM ET", "WEEK12 Broncos AT Carolina Panthers -Sun November 27 @ 1:00PM ET", "WEEK13 Broncos AT Baltimore Ravens -Sun December 4 @ 1:00PM ET", "WEEK14 Broncos VS. Kansas City Chiefs -Sun December 11 @ 8:20PM ET", "WEEK15 Broncos VS. Arizona Cardinals -Sun December 18 @ 4:05PM ET", "WEEK16 Broncos AT Los Angeles Rams -Sun December 25 @ 4:30PM ET", "WEEK17 Broncos AT Kansas City Chiefs -Sun January 1 @ 1:00PM ET", "WEEK18 Broncos VS. Los Angeles Chargers -Sun January 8 @ 1:00PM ET"], "Lions": ["WEEK1 Lions VS. Philadelphia Eagles -Sun September 11 @ 1:00PM ET", "WEEK2 Lions VS. Washington Commanders -Sun September 18 @ 1:00PM ET", "WEEK3 Lions AT Minnesota Vikings -Sun September 25 @ 1:00PM ET", "WEEK4 Lions VS. Seattle Seahawks -Sun October 2 @ 1:00PM ET", "WEEK5 Lions AT New England Patriots -Sun October 9 @ 1:00PM ET", "Bye Week", "WEEK7 Lions AT Dallas Cowboys -Sun October 23 @ 1:00PM ET", "WEEK8 Lions VS. Miami Dolphins -Sun October 30 @ 1:00PM ET", "WEEK9 Lions VS. Green Bay Packers -Sun November 6 @ 1:00PM ET", "WEEK10 Lions AT Chicago Bears -Sun November 13 @ 1:00PM ET", "WEEK11 Lions AT New York Giants -Sun November 20 @ 1:00PM ET", "WEEK12 Lions VS. Buffalo Bills -Thu November 24 @ 12:30PM ET", "WEEK13 Lions VS. Jacksonville Jaguars -Sun December 4 @ 1:00PM ET", "WEEK14 Lions VS. Minnesota Vikings -Sun December 11 @ 1:00PM ET", "WEEK15 Lions AT New York Jets -Sun December 18 @ 1:00PM ET", "WEEK16 Lions AT Carolina Panthers -Sat December 24 @ 1:00PM ET", "WEEK17 Lions VS. Chicago Bears -Sun January 1 @ 1:00PM ET", "WEEK18 Lions AT Green Bay Packers -Sun January 8 @ 1:00PM ET"], "Packers": ["WEEK1 Packers AT Minnesota Vikings -Sun September 11 @ 4:25PM ET", "WEEK2 Packers VS. Chicago Bears -Sun September 18 @ 8:20PM ET", "WEEK3 Packers AT Tampa Bay Buccaneers -Sun September 25 @ 4:25PM ET", "WEEK4 Packers VS. New England Patriots -Sun October 2 @ 4:25PM ET", "WEEK5 Packers VS. New York Giants -Sun October 9 @ 9:30AM ET", "WEEK6 Packers VS. New York Jets -Sun October 16 @ 1:00PM ET", "WEEK7 Packers AT Washington Commanders -Sun October 23 @ 1:00PM ET", "WEEK8 Packers AT Buffalo Bills -Sun October 30 @ 8:20PM ET", "WEEK9 Packers AT Detroit Lions -Sun November 6 @ 1:00PM ET", "WEEK10 Packers VS. Dallas Cowboys -Sun November 13 @ 4:25PM ET", "WEEK11 Packers VS. Tennessee Titans -Thu November 17 @ 8:15PM ET", "WEEK12 Packers AT Philadelphia Eagles -Sun November 27 @ 8:20PM ET", "WEEK13 Packers AT Chicago Bears -Sun December 4 @ 1:00PM ET", "Bye Week", "WEEK15 Packers VS. Los Angeles Rams -Mon December 19 @ 8:15PM ET", "WEEK16 Packers AT Miami Dolphins -Sun December 25 @ 1:00PM ET", "WEEK17 Packers VS. Minnesota Vikings -Sun January 1 @ 4:25PM ET", "WEEK18 Packers VS. Detroit Lions -Sun January 8 @ 1:00PM ET"], "Texans": ["WEEK1 Texans VS. Indianapolis Colts -Sun September 11 @ 1:00PM ET", "WEEK2 Texans AT Denver Broncos -Sun September 18 @ 4:25PM ET", "WEEK3 Texans AT Chicago Bears -Sun September 25 @ 1:00PM ET", "WEEK4 Texans VS. Los Angeles Chargers -Sun October 2 @ 1:00PM ET", "WEEK5 Texans AT Jacksonville Jaguars -Sun October 9 @ 1:00PM ET", "Bye Week", "WEEK7 Texans AT Las Vegas Raiders -Sun October 23 @ 4:05PM ET", "WEEK8 Texans VS. Tennessee Titans -Sun October 30 @ 4:05PM ET", "WEEK9 Texans VS. Philadelphia Eagles -Thu November 3 @ 8:15PM ET", "WEEK10 Texans AT New York Giants -Sun November 13 @ 1:00PM ET", "WEEK11 Texans VS. Washington Commanders -Sun November 20 @ 1:00PM ET", "WEEK12 Texans AT Miami Dolphins -Sun November 27 @ 1:00PM ET", "WEEK13 Texans VS. Cleveland Browns -Sun December 4 @ 1:00PM ET", "WEEK14 Texans AT Dallas Cowboys -Sun December 11 @ 1:00PM ET", "WEEK15 Texans VS. Kansas City Chiefs -Sun December 18 @ 1:00PM ET", "WEEK16 Texans AT Tennessee Titans -Sat December 24 @ 1:00PM ET", "WEEK17 Texans VS. Jacksonville Jaguars -Sun January 1 @ 1:00PM ET", "WEEK18 Texans AT Indianapolis Colts -Sun January 8 @ 1:00PM ET"], "Colts": ["WEEK1 Colts AT Houston Texans -Sun September 11 @ 1:00PM ET", "WEEK2 Colts AT Jacksonville Jaguars -Sun September 18 @ 1:00PM ET", "WEEK3 Colts VS. Kansas City Chiefs -Sun September 25 @ 1:00PM ET", "WEEK4 Colts VS. Tennessee Titans -Sun October 2 @ 1:00PM ET", "WEEK5 Colts AT Denver Broncos -Thu October 6 @ 8:15PM ET", "WEEK6 Colts VS. Jacksonville Jaguars -Sun October 16 @ 1:00PM ET", "WEEK7 Colts AT Tennessee Titans -Sun October 23 @ 1:00PM ET", "WEEK8 Colts VS. Washington Commanders -Sun October 30 @ 4:25PM ET", "WEEK9 Colts AT New England Patriots -Sun November 6 @ 1:00PM ET", "WEEK10 Colts AT Las Vegas Raiders -Sun November 13 @ 4:05PM ET", "WEEK11 Colts VS. Philadelphia Eagles -Sun November 20 @ 1:00PM ET", "WEEK12 Colts VS. Pittsburgh Steelers -Mon November 28 @ 8:15PM ET", "WEEK13 Colts AT Dallas Cowboys -Sun December 4 @ 8:20PM ET", "Bye Week", "WEEK15 Colts AT Minnesota Vikings -Sun December 18 @ 1:00PM ET", "WEEK16 Colts VS. Los Angeles Chargers -Mon December 26 @ 8:15PM ET", "WEEK17 Colts AT New York Giants -Sun January 1 @ 1:00PM ET", "WEEK18 Colts VS. Houston Texans -Sun January 8 @ 1:00PM ET"], "Jaguars": ["WEEK1 Jaguars AT Washington Commanders -Sun September 11 @ 1:00PM ET", "WEEK2 Jaguars VS. Indianapolis Colts -Sun September 18 @ 1:00PM ET", "WEEK3 Jaguars AT Los Angeles Chargers -Sun September 25 @ 4:05PM ET", "WEEK4 Jaguars AT Philadelphia Eagles -Sun October 2 @ 1:00PM ET", "WEEK5 Jaguars VS. Houston Texans -Sun October 9 @ 1:00PM ET", "WEEK6 Jaguars AT Indianapolis Colts -Sun October 16 @ 1:00PM ET", "WEEK7 Jaguars VS. New York Giants -Sun October 23 @ 1:00PM ET", "WEEK8 Jaguars VS. Denver Broncos -Sun October 30 @ 9:30AM ET", "WEEK9 Jaguars VS. Las Vegas Raiders -Sun November 6 @ 1:00PM ET", "WEEK10 Jaguars AT Kansas City Chiefs -Sun November 13 @ 1:00PM ET", "Bye Week", "WEEK12 Jaguars VS. Baltimore Ravens -Sun November 27 @ 1:00PM ET", "WEEK13 Jaguars AT Detroit Lions -Sun December 4 @ 1:00PM ET", "WEEK14 Jaguars AT Tennessee Titans -Sun December 11 @ 1:00PM ET", "WEEK15 Jaguars VS. Dallas Cowboys -Sun December 18 @ 1:00PM ET", "WEEK16 Jaguars AT New York Jets -Thu December 22 @ 8:15PM ET", "WEEK17 Jaguars AT Houston Texans -Sun January 1 @ 1:00PM ET", "WEEK18 Jaguars VS. Tennessee Titans -Sun January 8 @ 1:00PM ET"], "Chiefs": ["WEEK1 Chiefs AT Arizona Cardinals -Sun September 11 @ 4:25PM ET", "WEEK2 Chiefs VS. Los Angeles Chargers -Thu September 15 @ 8:15PM ET", "WEEK3 Chiefs AT Indianapolis Colts -Sun September 25 @ 1:00PM ET", "WEEK4 Chiefs AT Tampa Bay Buccaneers -Sun October 2 @ 8:20PM ET", "WEEK5 Chiefs VS. Las Vegas Raiders -Mon October 10 @ 8:15PM ET", "WEEK6 Chiefs VS. Buffalo Bills -Sun October 16 @ 4:25PM ET", "WEEK7 Chiefs AT San Francisco 49ers -Sun October 23 @ 4:25PM ET", "Bye Week", "WEEK9 Chiefs VS. Tennessee Titans -Sun November 6 @ 8:20PM ET", "WEEK10 Chiefs VS. Jacksonville Jaguars -Sun November 13 @ 1:00PM ET", "WEEK11 Chiefs AT Los Angeles Chargers -Sun November 20 @ 4:25PM ET", "WEEK12 Chiefs VS. Los Angeles Rams -Sun November 27 @ 4:25PM ET", "WEEK13 Chiefs AT Cincinnati Bengals -Sun December 4 @ 4:25PM ET", "WEEK14 Chiefs AT Denver Broncos -Sun December 11 @ 8:20PM ET", "WEEK15 Chiefs AT Houston Texans -Sun December 18 @ 1:00PM ET", "WEEK16 Chiefs VS. Seattle Seahawks -Sat December 24 @ 1:00PM ET", "WEEK17 Chiefs VS. Denver Broncos -Sun January 1 @ 1:00PM ET", "WEEK18 Chiefs AT Las Vegas Raiders -Sun January 8 @ 1:00PM ET"], "Chargers": ["WEEK1 Chargers VS. Las Vegas Raiders -Sun September 11 @ 4:25PM ET", "WEEK2 Chargers AT Kansas City Chiefs -Thu September 15 @ 8:15PM ET", "WEEK3 Chargers VS. Jacksonville Jaguars -Sun September 25 @ 4:05PM ET", "WEEK4 Chargers AT Houston Texans -Sun October 2 @ 1:00PM ET", "WEEK5 Chargers AT Cleveland Browns -Sun October 9 @ 1:00PM ET", "WEEK6 Chargers VS. Denver Broncos -Mon October 17 @ 8:15PM ET", "WEEK7 Chargers VS. Seattle Seahawks -Sun October 23 @ 4:25PM ET", "Bye Week", "WEEK9 Chargers AT Atlanta Falcons -Sun November 6 @ 1:00PM ET", "WEEK10 Chargers AT San Francisco 49ers -Sun November 13 @ 8:20PM ET", "WEEK11 Chargers VS. Kansas City Chiefs -Sun November 20 @ 4:25PM ET", "WEEK12 Chargers AT Arizona Cardinals -Sun November 27 @ 4:05PM ET", "WEEK13 Chargers AT Las Vegas Raiders -Sun December 4 @ 4:25PM ET", "WEEK14 Chargers VS. Miami Dolphins -Sun December 11 @ 4:05PM ET", "WEEK15 Chargers VS. Tennessee Titans -Sun December 18 @ 4:25PM ET", "WEEK16 Chargers AT Indianapolis Colts -Mon December 26 @ 8:15PM ET", "WEEK17 Chargers VS. Los Angeles Rams -Sun January 1 @ 8:20PM ET", "WEEK18 Chargers AT Denver Broncos -Sun January 8 @ 1:00PM ET"], "Rams": ["WEEK1 Rams VS. Buffalo Bills -Thu September 8 @ 8:20PM ET", "WEEK2 Rams VS. Atlanta Falcons -Sun September 18 @ 4:05PM ET", "WEEK3 Rams AT Arizona Cardinals -Sun September 25 @ 4:25PM ET", "WEEK4 Rams AT San Francisco 49ers -Mon October 3 @ 8:15PM ET", "WEEK5 Rams VS. Dallas Cowboys -Sun October 9 @ 4:25PM ET", "WEEK6 Rams VS. Carolina Panthers -Sun October 16 @ 4:05PM ET", "Bye Week", "WEEK8 Rams VS. San Francisco 49ers -Sun October 30 @ 4:25PM ET", "WEEK9 Rams AT Tampa Bay Buccaneers -Sun November 6 @ 4:25PM ET", "WEEK10 Rams VS. Arizona Cardinals -Sun November 13 @ 4:25PM ET", "WEEK11 Rams AT New Orleans Saints -Sun November 20 @ 1:00PM ET", "WEEK12 Rams AT Kansas City Chiefs -Sun November 27 @ 4:25PM ET", "WEEK13 Rams VS. Seattle Seahawks -Sun December 4 @ 4:05PM ET", "WEEK14 Rams VS. Las Vegas Raiders -Thu December 8 @ 8:15PM ET", "WEEK15 Rams AT Green Bay Packers -Mon December 19 @ 8:15PM ET", "WEEK16 Rams VS. Denver Broncos -Sun December 25 @ 4:30PM ET", "WEEK17 Rams AT Los Angeles Chargers -Sun January 1 @ 8:20PM ET", "WEEK18 Rams AT Seattle Seahawks -Sun January 8 @ 1:00PM ET"], "Raiders": ["WEEK1 Raiders AT Los Angeles Chargers -Sun September 11 @ 4:25PM ET", "WEEK2 Raiders VS. Arizona Cardinals -Sun September 18 @ 4:25PM ET", "WEEK3 Raiders AT Tennessee Titans -Sun September 25 @ 1:00PM ET", "WEEK4 Raiders VS. Denver Broncos -Sun October 2 @ 4:25PM ET", "WEEK5 Raiders AT Kansas City Chiefs -Mon October 10 @ 8:15PM ET", "Bye Week", "WEEK7 Raiders VS. Houston Texans -Sun October 23 @ 4:05PM ET", "WEEK8 Raiders AT New Orleans Saints -Sun October 30 @ 1:00PM ET", "WEEK9 Raiders AT Jacksonville Jaguars -Sun November 6 @ 1:00PM ET", "WEEK10 Raiders VS. Indianapolis Colts -Sun November 13 @ 4:05PM ET", "WEEK11 Raiders AT Denver Broncos -Sun November 20 @ 4:05PM ET", "WEEK12 Raiders AT Seattle Seahawks -Sun November 27 @ 4:05PM ET", "WEEK13 Raiders VS. Los Angeles Chargers -Sun December 4 @ 4:25PM ET", "WEEK14 Raiders AT Los Angeles Rams -Thu December 8 @ 8:15PM ET", "WEEK15 Raiders VS. New England Patriots -Sun December 18 @ 8:20PM ET", "WEEK16 Raiders AT Pittsburgh Steelers -Sat December 24 @ 8:15PM ET", "WEEK17 Raiders VS. San Francisco 49ers -Sun January 1 @ 4:05PM ET", "WEEK18 Raiders VS. Kansas City Chiefs -Sun January 8 @ 1:00PM ET"], "Dolphins": ["WEEK1 Dolphins VS. New England Patriots -Sun September 11 @ 1:00PM ET", "WEEK2 Dolphins AT Baltimore Ravens -Sun September 18 @ 1:00PM ET", "WEEK3 Dolphins VS. Buffalo Bills -Sun September 25 @ 1:00PM ET", "WEEK4 Dolphins AT Cincinnati Bengals -Thu September 29 @ 8:15PM ET", "WEEK5 Dolphins AT New York Jets -Sun October 9 @ 1:00PM ET", "WEEK6 Dolphins VS. Minnesota Vikings -Sun October 16 @ 1:00PM ET", "WEEK7 Dolphins VS. Pittsburgh Steelers -Sun October 23 @ 8:20PM ET", "WEEK8 Dolphins AT Detroit Lions -Sun October 30 @ 1:00PM ET", "WEEK9 Dolphins AT Chicago Bears -Sun November 6 @ 1:00PM ET", "WEEK10 Dolphins VS. Cleveland Browns -Sun November 13 @ 1:00PM ET", "Bye Week", "WEEK12 Dolphins VS. Houston Texans -Sun November 27 @ 1:00PM ET", "WEEK13 Dolphins AT San Francisco 49ers -Sun December 4 @ 4:05PM ET", "WEEK14 Dolphins AT Los Angeles Chargers -Sun December 11 @ 4:05PM ET", "WEEK15 Dolphins AT Buffalo Bills -Sun December 18 @ 1:00PM ET", "WEEK16 Dolphins VS. Green Bay Packers -Sun December 25 @ 1:00PM ET", "WEEK17 Dolphins AT New England Patriots -Sun January 1 @ 1:00PM ET", "WEEK18 Dolphins VS. New York Jets -Sun January 8 @ 1:00PM ET"], "Vikings": ["WEEK1 Vikings VS. Green Bay Packers -Sun September 11 @ 4:25PM ET", "WEEK2 Vikings AT Philadelphia Eagles -Mon September 19 @ 8:30PM ET", "WEEK3 Vikings VS. Detroit Lions -Sun September 25 @ 1:00PM ET", "WEEK4 Vikings AT New Orleans Saints -Sun October 2 @ 9:30AM ET", "WEEK5 Vikings VS. Chicago Bears -Sun October 9 @ 1:00PM ET", "WEEK6 Vikings AT Miami Dolphins -Sun October 16 @ 1:00PM ET", "Bye Week", "WEEK8 Vikings VS. Arizona Cardinals -Sun October 30 @ 1:00PM ET", "WEEK9 Vikings AT Washington Commanders -Sun November 6 @ 1:00PM ET", "WEEK10 Vikings AT Buffalo Bills -Sun November 13 @ 1:00PM ET", "WEEK11 Vikings VS. Dallas Cowboys -Sun November 20 @ 4:25PM ET", "WEEK12 Vikings VS. New England Patriots -Thu November 24 @ 8:20PM ET", "WEEK13 Vikings VS. New York Jets -Sun December 4 @ 1:00PM ET", "WEEK14 Vikings AT Detroit Lions -Sun December 11 @ 1:00PM ET", "WEEK15 Vikings VS. Indianapolis Colts -Sun December 18 @ 1:00PM ET", "WEEK16 Vikings VS. New York Giants -Sat December 24 @ 1:00PM ET", "WEEK17 Vikings AT Green Bay Packers -Sun January 1 @ 4:25PM ET", "WEEK18 Vikings AT Chicago Bears -Sun January 8 @ 1:00PM ET"], "Saints": ["WEEK1 Saints AT Atlanta Falcons -Sun September 11 @ 1:00PM ET", "WEEK2 Saints VS. Tampa Bay Buccaneers -Sun September 18 @ 1:00PM ET", "WEEK3 Saints AT Carolina Panthers -Sun September 25 @ 1:00PM ET", "WEEK4 Saints VS. Minnesota Vikings -Sun October 2 @ 9:30AM ET", "WEEK5 Saints VS. Seattle Seahawks -Sun October 9 @ 1:00PM ET", "WEEK6 Saints VS. Cincinnati Bengals -Sun October 16 @ 1:00PM ET", "WEEK7 Saints AT Arizona Cardinals -Thu October 20 @ 8:15PM ET", "WEEK8 Saints VS. Las Vegas Raiders -Sun October 30 @ 1:00PM ET", "WEEK9 Saints VS. Baltimore Ravens -Mon November 7 @ 8:15PM ET", "WEEK10 Saints AT Pittsburgh Steelers -Sun November 13 @ 1:00PM ET", "WEEK11 Saints VS. Los Angeles Rams -Sun November 20 @ 1:00PM ET", "WEEK12 Saints AT San Francisco 49ers -Sun November 27 @ 4:25PM ET", "WEEK13 Saints AT Tampa Bay Buccaneers -Mon December 5 @ 8:15PM ET", "Bye Week", "WEEK15 Saints VS. Atlanta Falcons -Sun December 18 @ 1:00PM ET", "WEEK16 Saints AT Cleveland Browns -Sat December 24 @ 1:00PM ET", "WEEK17 Saints AT Philadelphia Eagles -Sun January 1 @ 1:00PM ET", "WEEK18 Saints VS. Carolina Panthers -Sun January 8 @ 1:00PM ET"], "Patriots": ["WEEK1 Patriots AT Miami Dolphins -Sun September 11 @ 1:00PM ET", "WEEK2 Patriots AT Pittsburgh Steelers -Sun September 18 @ 1:00PM ET", "WEEK3 Patriots VS. Baltimore Ravens -Sun September 25 @ 1:00PM ET", "WEEK4 Patriots AT Green Bay Packers -Sun October 2 @ 4:25PM ET", "WEEK5 Patriots VS. Detroit Lions -Sun October 9 @ 1:00PM ET", "WEEK6 Patriots AT Cleveland Browns -Sun October 16 @ 1:00PM ET", "WEEK7 Patriots VS. Chicago Bears -Mon October 24 @ 8:15PM ET", "WEEK8 Patriots AT New York Jets -Sun October 30 @ 1:00PM ET", "WEEK9 Patriots VS. Indianapolis Colts -Sun November 6 @ 1:00PM ET", "Bye Week", "WEEK11 Patriots VS. New York Jets -Sun November 20 @ 1:00PM ET", "WEEK12 Patriots AT Minnesota Vikings -Thu November 24 @ 8:20PM ET", "WEEK13 Patriots VS. Buffalo Bills -Thu December 1 @ 8:15PM ET", "WEEK14 Patriots AT Arizona Cardinals -Mon December 12 @ 8:15PM ET", "WEEK15 Patriots AT Las Vegas Raiders -Sun December 18 @ 8:20PM ET", "WEEK16 Patriots VS. Cincinnati Bengals -Sat December 24 @ 1:00PM ET", "WEEK17 Patriots VS. Miami Dolphins -Sun January 1 @ 1:00PM ET", "WEEK18 Patriots AT Buffalo Bills -Sun January 8 @ 1:00PM ET"], "Giants": ["WEEK1 Giants AT Tennessee Titans -Sun September 11 @ 4:25PM ET", "WEEK2 Giants VS. Carolina Panthers -Sun September 18 @ 1:00PM ET", "WEEK3 Giants VS. Dallas Cowboys -Mon September 26 @ 8:15PM ET", "WEEK4 Giants VS. Chicago Bears -Sun October 2 @ 1:00PM ET", "WEEK5 Giants AT Green Bay Packers -Sun October 9 @ 9:30AM ET", "WEEK6 Giants VS. Baltimore Ravens -Sun October 16 @ 1:00PM ET", "WEEK7 Giants AT Jacksonville Jaguars -Sun October 23 @ 1:00PM ET", "WEEK8 Giants AT Seattle Seahawks -Sun October 30 @ 4:25PM ET", "Bye Week", "WEEK10 Giants VS. Houston Texans -Sun November 13 @ 1:00PM ET", "WEEK11 Giants VS. Detroit Lions -Sun November 20 @ 1:00PM ET", "WEEK12 Giants AT Dallas Cowboys -Thu November 24 @ 4:30PM ET", "WEEK13 Giants VS. Washington Commanders -Sun December 4 @ 1:00PM ET", "WEEK14 Giants VS. Philadelphia Eagles -Sun December 11 @ 1:00PM ET", "WEEK15 Giants AT Washington Commanders -Sun December 18 @ 1:00PM ET", "WEEK16 Giants AT Minnesota Vikings -Sat December 24 @ 1:00PM ET", "WEEK17 Giants VS. Indianapolis Colts -Sun January 1 @ 1:00PM ET", "WEEK18 Giants AT Philadelphia Eagles -Sun January 8 @ 1:00PM ET"], "Jets": ["WEEK1 Jets VS. Baltimore Ravens -Sun September 11 @ 1:00PM ET", "WEEK2 Jets AT Cleveland Browns -Sun September 18 @ 1:00PM ET", "WEEK3 Jets VS. Cincinnati Bengals -Sun September 25 @ 1:00PM ET", "WEEK4 Jets AT Pittsburgh Steelers -Sun October 2 @ 1:00PM ET", "WEEK5 Jets VS. Miami Dolphins -Sun October 9 @ 1:00PM ET", "WEEK6 Jets AT Green Bay Packers -Sun October 16 @ 1:00PM ET", "WEEK7 Jets AT Denver Broncos -Sun October 23 @ 4:05PM ET", "WEEK8 Jets VS. New England Patriots -Sun October 30 @ 1:00PM ET", "WEEK9 Jets VS. Buffalo Bills -Sun November 6 @ 1:00PM ET", "Bye Week", "WEEK11 Jets AT New England Patriots -Sun November 20 @ 1:00PM ET", "WEEK12 Jets VS. Chicago Bears -Sun November 27 @ 1:00PM ET", "WEEK13 Jets AT Minnesota Vikings -Sun December 4 @ 1:00PM ET", "WEEK14 Jets AT Buffalo Bills -Sun December 11 @ 1:00PM ET", "WEEK15 Jets VS. Detroit Lions -Sun December 18 @ 1:00PM ET", "WEEK16 Jets VS. Jacksonville Jaguars -Thu December 22 @ 8:15PM ET", "WEEK17 Jets AT Seattle Seahawks -Sun January 1 @ 4:05PM ET", "WEEK18 Jets AT Miami Dolphins -Sun January 8 @ 1:00PM ET"], "Eagles": ["WEEK1 Eagles AT Detroit Lions -Sun September 11 @ 1:00PM ET", "WEEK2 Eagles VS. Minnesota Vikings -Mon September 19 @ 8:30PM ET", "WEEK3 Eagles AT Washington Commanders -Sun September 25 @ 1:00PM ET", "WEEK4 Eagles VS. Jacksonville Jaguars -Sun October 2 @ 1:00PM ET", "WEEK5 Eagles AT Arizona Cardinals -Sun October 9 @ 4:25PM ET", "WEEK6 Eagles VS. Dallas Cowboys -Sun October 16 @ 8:20PM ET", "Bye Week", "WEEK8 Eagles VS. Pittsburgh Steelers -Sun October 30 @ 1:00PM ET", "WEEK9 Eagles AT Houston Texans -Thu November 3 @ 8:15PM ET", "WEEK10 Eagles VS. Washington Commanders -Mon November 14 @ 8:15PM ET", "WEEK11 Eagles AT Indianapolis Colts -Sun November 20 @ 1:00PM ET", "WEEK12 Eagles VS. Green Bay Packers -Sun November 27 @ 8:20PM ET", "WEEK13 Eagles VS. Tennessee Titans -Sun December 4 @ 1:00PM ET", "WEEK14 Eagles AT New York Giants -Sun December 11 @ 1:00PM ET", "WEEK15 Eagles AT Chicago Bears -Sun December 18 @ 1:00PM ET", "WEEK16 Eagles AT Dallas Cowboys -Sat December 24 @ 4:25PM ET", "WEEK17 Eagles VS. New Orleans Saints -Sun January 1 @ 1:00PM ET", "WEEK18 Eagles VS. New York Giants -Sun January 8 @ 1:00PM ET"], "Steelers": ["WEEK1 Steelers AT Cincinnati Bengals -Sun September 11 @ 1:00PM ET", "WEEK2 Steelers VS. New England Patriots -Sun September 18 @ 1:00PM ET", "WEEK3 Steelers AT Cleveland Browns -Thu September 22 @ 8:15PM ET", "WEEK4 Steelers VS. New York Jets -Sun October 2 @ 1:00PM ET", "WEEK5 Steelers AT Buffalo Bills -Sun October 9 @ 1:00PM ET", "WEEK6 Steelers VS. Tampa Bay Buccaneers -Sun October 16 @ 1:00PM ET", "WEEK7 Steelers AT Miami Dolphins -Sun October 23 @ 8:20PM ET", "WEEK8 Steelers AT Philadelphia Eagles -Sun October 30 @ 1:00PM ET", "Bye Week", "WEEK10 Steelers VS. New Orleans Saints -Sun November 13 @ 1:00PM ET", "WEEK11 Steelers VS. Cincinnati Bengals -Sun November 20 @ 8:20PM ET", "WEEK12 Steelers AT Indianapolis Colts -Mon November 28 @ 8:15PM ET", "WEEK13 Steelers AT Atlanta Falcons -Sun December 4 @ 1:00PM ET", "WEEK14 Steelers VS. Baltimore Ravens -Sun December 11 @ 1:00PM ET", "WEEK15 Steelers AT Carolina Panthers -Sun December 18 @ 1:00PM ET", "WEEK16 Steelers VS. Las Vegas Raiders -Sat December 24 @ 8:15PM ET", "WEEK17 Steelers AT Baltimore Ravens -Sun January 1 @ 1:00PM ET", "WEEK18 Steelers VS. Cleveland Browns -Sun January 8 @ 1:00PM ET"], "Seahawks": ["WEEK1 Seahawks VS. Denver Broncos -Mon September 12 @ 8:20PM ET", "WEEK2 Seahawks AT San Francisco 49ers -Sun September 18 @ 4:05PM ET", "WEEK3 Seahawks VS. Atlanta Falcons -Sun September 25 @ 4:25PM ET", "WEEK4 Seahawks AT Detroit Lions -Sun October 2 @ 1:00PM ET", "WEEK5 Seahawks AT New Orleans Saints -Sun October 9 @ 1:00PM ET", "WEEK6 Seahawks VS. Arizona Cardinals -Sun October 16 @ 4:05PM ET", "WEEK7 Seahawks AT Los Angeles Chargers -Sun October 23 @ 4:25PM ET", "WEEK8 Seahawks VS. New York Giants -Sun October 30 @ 4:25PM ET", "WEEK9 Seahawks AT Arizona Cardinals -Sun November 6 @ 4:05PM ET", "WEEK10 Seahawks AT Tampa Bay Buccaneers -Sun November 13 @ 9:30AM ET", "Bye Week", "WEEK12 Seahawks VS. Las Vegas Raiders -Sun November 27 @ 4:05PM ET", "WEEK13 Seahawks AT Los Angeles Rams -Sun December 4 @ 4:05PM ET", "WEEK14 Seahawks VS. Carolina Panthers -Sun December 11 @ 4:25PM ET", "WEEK15 Seahawks VS. San Francisco 49ers -Thu December 15 @ 8:15PM ET", "WEEK16 Seahawks AT Kansas City Chiefs -Sat December 24 @ 1:00PM ET", "WEEK17 Seahawks VS. New York Jets -Sun January 1 @ 4:05PM ET", "WEEK18 Seahawks VS. Los Angeles Rams -Sun January 8 @ 1:00PM ET"], "49ers": ["WEEK1 49ers AT Chicago Bears -Sun September 11 @ 1:00PM ET", "WEEK2 49ers VS. Seattle Seahawks -Sun September 18 @ 4:05PM ET", "WEEK3 49ers AT Denver Broncos -Sun September 25 @ 8:20PM ET", "WEEK4 49ers VS. Los Angeles Rams -Mon October 3 @ 8:15PM ET", "WEEK5 49ers AT Carolina Panthers -Sun October 9 @ 4:05PM ET", "WEEK6 49ers AT Atlanta Falcons -Sun October 16 @ 1:00PM ET", "WEEK7 49ers VS. Kansas City Chiefs -Sun October 23 @ 4:25PM ET", "WEEK8 49ers AT Los Angeles Rams -Sun October 30 @ 4:25PM ET", "Bye Week", "WEEK10 49ers VS. Los Angeles Chargers -Sun November 13 @ 8:20PM ET", "WEEK11 49ers AT Arizona Cardinals -Mon November 21 @ 8:15PM ET", "WEEK12 49ers VS. New Orleans Saints -Sun November 27 @ 4:25PM ET", "WEEK13 49ers VS. Miami Dolphins -Sun December 4 @ 4:05PM ET", "WEEK14 49ers VS. Tampa Bay Buccaneers -Sun December 11 @ 4:25PM ET", "WEEK15 49ers AT Seattle Seahawks -Thu December 15 @ 8:15PM ET", "WEEK16 49ers VS. Washington Commanders -Sat December 24 @ 4:05PM ET", "WEEK17 49ers AT Las Vegas Raiders -Sun January 1 @ 4:05PM ET", "WEEK18 49ers VS. Arizona Cardinals -Sun January 8 @ 1:00PM ET"], "Buccaneers": ["WEEK1 Buccaneers AT Dallas Cowboys -Sun September 11 @ 8:20PM ET", "WEEK2 Buccaneers AT New Orleans Saints -Sun September 18 @ 1:00PM ET", "WEEK3 Buccaneers VS. Green Bay Packers -Sun September 25 @ 4:25PM ET", "WEEK4 Buccaneers VS. Kansas City Chiefs -Sun October 2 @ 8:20PM ET", "WEEK5 Buccaneers VS. Atlanta Falcons -Sun October 9 @ 1:00PM ET", "WEEK6 Buccaneers AT Pittsburgh Steelers -Sun October 16 @ 1:00PM ET", "WEEK7 Buccaneers AT Carolina Panthers -Sun October 23 @ 1:00PM ET", "WEEK8 Buccaneers VS. Baltimore Ravens -Thu October 27 @ 8:15PM ET", "WEEK9 Buccaneers VS. Los Angeles Rams -Sun November 6 @ 4:25PM ET", "WEEK10 Buccaneers VS. Seattle Seahawks -Sun November 13 @ 9:30AM ET", "Bye Week", "WEEK12 Buccaneers AT Cleveland Browns -Sun November 27 @ 1:00PM ET", "WEEK13 Buccaneers VS. New Orleans Saints -Mon December 5 @ 8:15PM ET", "WEEK14 Buccaneers AT San Francisco 49ers -Sun December 11 @ 4:25PM ET", "WEEK15 Buccaneers VS. Cincinnati Bengals -Sun December 18 @ 4:25PM ET", "WEEK16 Buccaneers AT Arizona Cardinals -Sun December 25 @ 8:20PM ET", "WEEK17 Buccaneers VS. Carolina Panthers -Sun January 1 @ 1:00PM ET", "WEEK18 Buccaneers AT Atlanta Falcons -Sun January 8 @ 1:00PM ET"], "Titans": ["WEEK1 Titans VS. New York Giants -Sun September 11 @ 4:25PM ET", "WEEK2 Titans AT Buffalo Bills -Mon September 19 @ 7:15PM ET", "WEEK3 Titans VS. Las Vegas Raiders -Sun September 25 @ 1:00PM ET", "WEEK4 Titans AT Indianapolis Colts -Sun October 2 @ 1:00PM ET", "WEEK5 Titans AT Washington Commanders -Sun October 9 @ 1:00PM ET", "Bye Week", "WEEK7 Titans VS. Indianapolis Colts -Sun October 23 @ 1:00PM ET", "WEEK8 Titans AT Houston Texans -Sun October 30 @ 4:05PM ET", "WEEK9 Titans AT Kansas City Chiefs -Sun November 6 @ 8:20PM ET", "WEEK10 Titans VS. Denver Broncos -Sun November 13 @ 1:00PM ET", "WEEK11 Titans AT Green Bay Packers -Thu November 17 @ 8:15PM ET", "WEEK12 Titans VS. Cincinnati Bengals -Sun November 27 @ 1:00PM ET", "WEEK13 Titans AT Philadelphia Eagles -Sun December 4 @ 1:00PM ET", "WEEK14 Titans VS. Jacksonville Jaguars -Sun December 11 @ 1:00PM ET", "WEEK15 Titans AT Los Angeles Chargers -Sun December 18 @ 4:25PM ET", "WEEK16 Titans VS. Houston Texans -Sat December 24 @ 1:00PM ET", "WEEK17 Titans VS. Dallas Cowboys -Thu December 29 @ 8:15PM ET", "WEEK18 Titans AT Jacksonville Jaguars -Sun January 8 @ 1:00PM ET"], "Commandos": ["WEEK1 Commandos VS. Jacksonville Jaguars -Sun September 11 @ 1:00PM ET", "WEEK2 Commandos AT Detroit Lions -Sun September 18 @ 1:00PM ET", "WEEK3 Commandos VS. Philadelphia Eagles -Sun September 25 @ 1:00PM ET", "WEEK4 Commandos AT Dallas Cowboys -Sun October 2 @ 1:00PM ET", "WEEK5 Commandos VS. Tennessee Titans -Sun October 9 @ 1:00PM ET", "WEEK6 Commandos AT Chicago Bears -Thu October 13 @ 8:15PM ET", "WEEK7 Commandos VS. Green Bay Packers -Sun October 23 @ 1:00PM ET", "WEEK8 Commandos AT Indianapolis Colts -Sun October 30 @ 4:25PM ET", "WEEK9 Commandos VS. Minnesota Vikings -Sun November 6 @ 1:00PM ET", "WEEK10 Commandos AT Philadelphia Eagles -Mon November 14 @ 8:15PM ET", "WEEK11 Commandos AT Houston Texans -Sun November 20 @ 1:00PM ET", "WEEK12 Commandos VS. Atlanta Falcons -Sun November 27 @ 1:00PM ET", "WEEK13 Commandos AT New York Giants -Sun December 4 @ 1:00PM ET", "Bye Week", "WEEK15 Commandos VS. New York Giants -Sun December 18 @ 1:00PM ET", "WEEK16 Commandos AT San Francisco 49ers -Sat December 24 @ 4:05PM ET", "WEEK17 Commandos VS. Cleveland Browns -Sun January 1 @ 1:00PM ET", "WEEK18 Commandos VS. Dallas Cowboys -Sun January 8 @ 1:00PM ET"]}